<a href="https://colab.research.google.com/github/kurtsenol/pandas/blob/master/pandas_text_manipulation.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
df= pd.read_csv("/content/drive/My Drive/den.csv")
df

    Brownlow Arms https://thegoodpubguide.co.uk/pub/ng32+2az/brownlow+arms/
0     Seven Stars  https://thegoodpubguide.co.uk/pub/wc2a+2jb/sev...
1            Name                                                Url
2      Bridge Inn  https://thegoodpubguide.co.uk/pub/hr2+0jw/brid...
3   Fox Goes Free  https://thegoodpubguide.co.uk/pub/po18+0hu/fox...
4            Bull   https://thegoodpubguide.co.uk/pub/sg14+3sb/bull/
5  Kilchrenan Inn  https://thegoodpubguide.co.uk/pub/pa35+1hd/kil...
6       Refectory  https://thegoodpubguide.co.uk/pub/gu8+5hj/refe...

In [ ]:
df= pd.read_csv("/content/drive/My Drive/den.csv", header=2)
df

             Name                                                Url
0      Bridge Inn  https://thegoodpubguide.co.uk/pub/hr2+0jw/brid...
1   Fox Goes Free  https://thegoodpubguide.co.uk/pub/po18+0hu/fox...
2            Bull   https://thegoodpubguide.co.uk/pub/sg14+3sb/bull/
3  Kilchrenan Inn  https://thegoodpubguide.co.uk/pub/pa35+1hd/kil...
4       Refectory  https://thegoodpubguide.co.uk/pub/gu8+5hj/refe...

In [ ]:
df = pd.read_csv("https://raw.githubusercontent.com/yunglinchang/DataScience_playground/master/Pandas/data/TheFruit_sales.csv", index_col=0)
df

              Sales_ID  Sales_Branch  ...       Recent_Sales_Date Customer_Count
0  AU_1382578        !           NaN  ...  2019/12/31 GMT+8 18:00             10
1   TW_8312566       !           NaN  ...  2019/12/31 GMT+8 18:00             27
2   US_2289987       !           NaN  ...  2019/12/29 GMT+8 18:00             12
3   UK_1382574       !           NaN  ...  2019/12/15 GMT+8 05:00              1
4   TW_1382578       !           NaN  ...  2019/12/29 GMT+8 05:00              5
5   AU_1335358       !           NaN  ...  2019/12/31 GMT+8 05:00             10
6   TW_6662597       !           NaN  ...  2019/12/31 GMT+8 15:00              1
7   TW_3352571       !           NaN  ...  2019/12/27 GMT+8 18:00              3
8   US_7683478       !           NaN  ...  2019/12/31 GMT+8 18:00             17
9   US_4523771       !           NaN  ...  2019/12/30 GMT+8 18:00             51

[10 rows x 5 columns]

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Sales_ID             10 non-null     object
 1   Sales_Branch         0 non-null      float64
 2   Product_Description  10 non-null     object
 3   Recent_Sales_Date    10 non-null     object
 4   Customer_Count       10 non-null     int64
dtypes: float64(1), int64(1), object(3)
memory usage: 480.0+ bytes

In [ ]:
df.Sales_ID[:5]

0    AU_1382578        !
1     TW_8312566       !
2     US_2289987       !
3     UK_1382574       !
4     TW_1382578       !
Name: Sales_ID, dtype: object

unnecessary spaces and an exclamation mark for the ID itself

In [ ]:
df["Sales_ID"] = df.Sales_ID.str.rstrip("!").str.strip()

In [ ]:
df.Sales_ID[:5]

0    AU_1382578
1    TW_8312566
2    US_2289987
3    UK_1382574
4    TW_1382578
Name: Sales_ID, dtype: object

Fill 'Sales_Branch' from "Sales_ID" column

In [ ]:
df['Sales_Branch'] = df["Sales_ID"].str[:2]

In [ ]:
df

     Sales_ID Sales_Branch  ...       Recent_Sales_Date Customer_Count
0  AU_1382578           AU  ...  2019/12/31 GMT+8 18:00             10
1  TW_8312566           TW  ...  2019/12/31 GMT+8 18:00             27
2  US_2289987           US  ...  2019/12/29 GMT+8 18:00             12
3  UK_1382574           UK  ...  2019/12/15 GMT+8 05:00              1
4  TW_1382578           TW  ...  2019/12/29 GMT+8 05:00              5
5  AU_1335358           AU  ...  2019/12/31 GMT+8 05:00             10
6  TW_6662597           TW  ...  2019/12/31 GMT+8 15:00              1
7  TW_3352571           TW  ...  2019/12/27 GMT+8 18:00              3
8  US_7683478           US  ...  2019/12/31 GMT+8 18:00             17
9  US_4523771           US  ...  2019/12/30 GMT+8 18:00             51

[10 rows x 5 columns]

In [ ]:
df['Product_Description'][0]

'The Fruit, a company that sells fruits from all over the world, has branches in Australia, the United Kingdom, the United States, and Taiwan. Product: Apple Mango Banana Watermelon Orange Blueberry Banana Watermelon Kiwifruit'

We can see that while all of the first sentences were identical, we can split this into 2 columns: Description and Product.

In [ ]:
df[['Description', 'Product']] = df['Product_Description'].str.split("Product: ", expand=True)
df

     Sales_ID  ...                                            Product
0  AU_1382578  ...  Apple Mango Banana Watermelon Orange Blueberry...
1  TW_8312566  ...  Orange Pear Mango Papaya Peach Persimmon Lyche...
2  US_2289987  ...     Apple Orange Blueberry Lemon Cantaloupe Cherry
3  UK_1382574  ...                                         Strawberry
4  TW_1382578  ...  Mango Papaya Watermelon Lychee Guava Grape Longan
5  AU_1335358  ...  Apple Orange Blueberry Mango Banana Watermelon...
6  TW_6662597  ...                           Apple Pomelo Mango Guava
7  TW_3352571  ...       Pomelo Persimmon Roselle Tangerine Pineapple
8  US_7683478  ...                Raspberry Blueberry Pineapple Peach
9  US_4523771  ...                   Blueberry Cherry Pear Blackberry

[10 rows x 7 columns]

sort the list of products in the Product column.

In [ ]:
df["Product"] =df["Product"].str.split().apply(sorted)

In [ ]:
df["Product"]

0    [Apple, Banana, Banana, Blueberry, Kiwifruit, ...
1    [Guava, Lychee, Mango, Orange, Papaya, Peach, ...
2    [Apple, Blueberry, Cantaloupe, Cherry, Lemon, ...
3                                         [Strawberry]
4    [Grape, Guava, Longan, Lychee, Mango, Papaya, ...
5    [Apple, Avocado, Banana, Blueberry, Kiwifruit,...
6                        [Apple, Guava, Mango, Pomelo]
7    [Persimmon, Pineapple, Pomelo, Roselle, Tanger...
8             [Blueberry, Peach, Pineapple, Raspberry]
9                [Blackberry, Blueberry, Cherry, Pear]
Name: Product, dtype: object

In [ ]:
df['Product_Count'] = df["Product"].str.len()
df['Product_Count']

0    9
1    8
2    6
3    1
4    7
5    9
6    4
7    5
8    4
9    4
Name: Product_Count, dtype: int64

who sells the most variety of fruits in The Fruit!

In [ ]:
df[df['Product_Count']==df['Product_Count'].max()]

     Sales_ID  ... Product_Count
0  AU_1382578  ...             9
5  AU_1335358  ...             9

[2 rows x 8 columns]

Split this column into Product_n

In [ ]:
Products = df['Product'].apply(pd.Series)
Products

            0          1           2  ...           6           7           8
0       Apple     Banana      Banana  ...      Orange  Watermelon  Watermelon
1       Guava     Lychee       Mango  ...        Pear   Persimmon         NaN
2       Apple  Blueberry  Cantaloupe  ...         NaN         NaN         NaN
3  Strawberry        NaN         NaN  ...         NaN         NaN         NaN
4       Grape      Guava      Longan  ...  Watermelon         NaN         NaN
5       Apple    Avocado      Banana  ...      Orange  Stonefruit  Watermelon
6       Apple      Guava       Mango  ...         NaN         NaN         NaN
7   Persimmon  Pineapple      Pomelo  ...         NaN         NaN         NaN
8   Blueberry      Peach   Pineapple  ...         NaN         NaN         NaN
9  Blackberry  Blueberry      Cherry  ...         NaN         NaN         NaN

[10 rows x 9 columns]

In [ ]:
Products.columns = ["Product_"+str(i) for i in range(9)]

In [ ]:
Products

    Product_0  Product_1   Product_2  ...   Product_6   Product_7   Product_8
0       Apple     Banana      Banana  ...      Orange  Watermelon  Watermelon
1       Guava     Lychee       Mango  ...        Pear   Persimmon         NaN
2       Apple  Blueberry  Cantaloupe  ...         NaN         NaN         NaN
3  Strawberry        NaN         NaN  ...         NaN         NaN         NaN
4       Grape      Guava      Longan  ...  Watermelon         NaN         NaN
5       Apple    Avocado      Banana  ...      Orange  Stonefruit  Watermelon
6       Apple      Guava       Mango  ...         NaN         NaN         NaN
7   Persimmon  Pineapple      Pomelo  ...         NaN         NaN         NaN
8   Blueberry      Peach   Pineapple  ...         NaN         NaN         NaN
9  Blackberry  Blueberry      Cherry  ...         NaN         NaN         NaN

[10 rows x 9 columns]

Do one-hot encoding on each product

We are using the original form from the split because we can use whitespace to separate them. (Fill free to try using the list form with a loop!)

In [ ]:
Products2 = df['Product_Description'].str.split(': ', expand=True)[1]
Products2

0    Apple Mango Banana Watermelon Orange Blueberry...
1    Orange Pear Mango Papaya Peach Persimmon Lyche...
2       Apple Orange Blueberry Lemon Cantaloupe Cherry
3                                           Strawberry
4    Mango Papaya Watermelon Lychee Guava Grape Longan
5    Apple Orange Blueberry Mango Banana Watermelon...
6                             Apple Pomelo Mango Guava
7         Pomelo Persimmon Roselle Tangerine Pineapple
8                  Raspberry Blueberry Pineapple Peach
9                     Blueberry Cherry Pear Blackberry
Name: 1, dtype: object

In [ ]:
Products2 = df['Product_Description'].str.split(': ', expand=True)[1].str.get_dummies(' ')
Products2

   Apple  Avocado  Banana  ...  Strawberry  Tangerine  Watermelon
0      1        0       1  ...           0          0           1
1      0        0       0  ...           0          0           0
2      1        0       0  ...           0          0           0
3      0        0       0  ...           1          0           0
4      0        0       0  ...           0          0           1
5      1        1       1  ...           0          0           1
6      1        0       0  ...           0          0           0
7      0        0       0  ...           0          1           0
8      0        0       0  ...           0          0           0
9      0        0       0  ...           0          0           0

[10 rows x 27 columns]

turn the Recent_Sales_Date column into a year-month-day format.

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 10 entries, 0 to 9
Data columns (total 8 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Sales_ID             10 non-null     object
 1   Sales_Branch         10 non-null     object
 2   Product_Description  10 non-null     object
 3   Recent_Sales_Date    10 non-null     object
 4   Customer_Count       10 non-null     int64
 5   Description          10 non-null     object
 6   Product              10 non-null     object
 7   Product_Count        10 non-null     int64
dtypes: int64(2), object(6)
memory usage: 1.0+ KB

In [ ]:
df["Recent_Sales_Date"] = pd.to_datetime(df["Recent_Sales_Date"].str.split(expand=True)[0])

In [ ]:
df["Recent_Sales_Date"]

0   2019-12-31
1   2019-12-31
2   2019-12-29
3   2019-12-15
4   2019-12-29
5   2019-12-31
6   2019-12-31
7   2019-12-27
8   2019-12-31
9   2019-12-30
Name: Recent_Sales_Date, dtype: datetime64[ns]